{
  "rasa_nlu_data": {
    "common_examples": [
      {
        "intent": "plot",
        "text": "Plot histogram of employee’s age"
      },
      {
        "intent": "plot",
        "text": "Plot number of employees for each gender as a pie chart"
      },
      {
        "intent": "plot",
        "text": "Plot number of employees for each gender as a pie chart for all departments"
      },
      {
        "intent": "plot",
        "text": "Plot average pay rate of each race as a bar chart"
      },
      {
        "intent": "plot",
        "text": "Plot number of employees hired each year as a line chart"
      },
      {
        "intent": "plot",
        "text": "Make a scatter plot with age and pay rate"
      },
      {
        "intent": "plot",
        "text": "plot histogram of number of employees per department"
      },
      {
        "intent": "plot",
        "text": "Plot average salary for each gender as a pie chart for all departments"
      },
      {
        "intent": "plot",
        "text": "Plot employee’s age as a histogram"
      },
      {
        "intent": "plot",
        "text": "Plot histogram of employee’s pay rate"
      },
      {
        "intent": "plot",
        "text": "Plot employee’s pay rate as a histogram"
      },
      {
        "intent": "plot",
        "text": "Plot bar chart of average pay rate of each race"
      },
      {
        "intent": "plot",
        "text": "Plot average age of each state as a bar graph"
      },
      {
        "intent": "plot",
        "text": "Plot bar graph of maximum pay rate of each sex"
      },
      {
        "intent": "plot",
        "text": "Plot bar chart of max pay rate of each gender"
      },
      {
        "intent": "plot",
        "text": "Plot minimum pay rate of each department as a bar chart"
      },
      {
        "intent": "plot",
        "text": "Make bar graph of maximum pay rate per position"
      },
      {
        "intent": "plot",
        "text": "Make bar graph of avg pay rate of every position"
      },
      {
        "intent": "plot",
        "text": "Plot bar chart of min age per sex"
      },
      {
        "intent": "plot",
        "text": "Plot bar chart of count of employees per department"
      },
      {
        "intent": "plot",
        "text": "Make bar graph of number employees in each gender per position"
      },
      {
        "intent": "plot",
        "text": "Draw bar chart of number of employees of each status"
      },
      {
        "intent": "plot",
        "text": "Plot count of employees at each position in every department as a bar chart"
      },
      {
        "text": "calculate the average age of each sex on a bar chart"
      },
      {
        "text": "give me the average age of each sex on a bar chart"
      },
      {
        "text": "display percentage of each sex on a pie chart"
      },
      {
        "text": "show me the distribution of age on a histogram"
      },
      {
        "text": "show MaritalDesc of employees whose age is between 28 and 32 on a bar chart"
      },
      {
        "text": "Count the number of ShortName for each region and plot a bar chart"
      },
      {
        "text": "Count the number of ShortName based on CurrencyUnit and plot a bar chart"
      },
      {
        "text": "Plot a scatter plot by using region and IncomeGroup"
      },
      {
        "text": "Plot a scatter graph of age vs salary for each department where average salary is more than 10."
      },
      {
        "text": "Plot a line graph of age vs salary for each department having highest age is less than 50."
      },
      {
        "text": "Make a bar graph of average of top ten salaries per department with minimum age greater than 30."
      },
      {
        "text": "Make a pie chart of number of employees with age greater than 30 in each department."
      },
      {
        "text": "Make a bar chart of average of top ten with employee’s age greater than 30 in each state."
      },
      {
        "text": "Number of employees with name “John Doe” department wise in a pie chart."
      },
      {
        "text": "Draw a histogram of employees who joined in the year 2015"
      },
      {
        "text": "Draw a histogram of employees who left in the year 2015"
      },
      {
        "text": "Number of employees against Year of Hire as a line chart."
      },
      {
        "text": "Bar chart of number of employees joining each year."
      },
      {
        "text": "Bar chart of number of employees leaving each year."
      },
      {
        "text": "Bar chart of number of employees leaving each year per department having age below 30"
      },
      {
        "text": "Bar chart of number of employees with age lesser than 30 leaving each year per department in state MA."
      }
    ],
    "regex_features": [],
    "entity_synonyms": []
  }
}